# Pandas

![](https://quera.ir/qbox/view/yhNRcnAWD9/pandas.jpg)

In [66]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\shayan\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\shayan\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.1.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\shayan\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\shayan\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\shayan\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\shayan\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

# Data Series

In [67]:
import pandas as pd
import numpy as np

s_int = pd.Series([1,2,3,4,5])

s_float = pd.Series([1.1, 2.2 ,3.3, 4.4])

s_str = pd.Series(["parsa", "parto", "hamed", "sajjad"])

In [68]:
s = pd.Series([-1,4,-3])
print(s)

0   -1
1    4
2   -3
dtype: int64

In [69]:
s.index

RangeIndex(start=0, stop=3, step=1)

In [70]:
s.values

array([-1,  4, -3])

![](https://quera.org/qbox/view/b3ncQEIlqm/series.jpg)

In [71]:
type(s.values)

numpy.ndarray

In [72]:
s.to_list()

[-1, 4, -3]

In [73]:
np.max(s)

np.int64(4)

In [74]:
s = pd.Series([19, 16, 20], index= ["a","b","c"])
s

a    19
b    16
c    20
dtype: int64

In [75]:
s.index = ['ali', 'gholi', 'vali']
s

ali      19
gholi    16
vali     20
dtype: int64

In [76]:
s[1]

C:\Users\Shayan\AppData\Local\Temp\ipykernel_17960\785827006.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[1]

np.int64(16)

In [77]:
s['gholi']

np.int64(16)

In [78]:
s['gholi'] = 20
s

ali      19
gholi    20
vali     20
dtype: int64

In [79]:
purity_dictionary = {
"Ali" : 19 ,
"Gholi" : 16 ,
"Vali" : 20
}

purity_series = pd.Series(purity_dictionary)
purity_series

Ali      19
Gholi    16
Vali     20
dtype: int64

# DataFrame

In [80]:
import pandas as pd
import numpy as np

cars_dictionary = {
    "model" :[ "Peykan", "BMW X6", "Peugeot 206", "Tiba", "Nissan Junior", "Peykan Vanet", "renault 5"],
    "Color" :["Red", "White", "Black", "White", "Blue", "Red", "Silver"],
    "HP" :[48, 335, 105, 87, 93, 80, 48],
    "Weight (KG)": [990, 2320, 1025, 1027, 1540, 960, 850],
    "price" :[33, 2400, 105, 120, 230, 68, 38]
}

df = pd.DataFrame(cars_dictionary)

df

           model   Color   HP  Weight (KG)  price
0         Peykan     Red   48          990     33
1         BMW X6   White  335         2320   2400
2    Peugeot 206   Black  105         1025    105
3           Tiba   White   87         1027    120
4  Nissan Junior    Blue   93         1540    230
5   Peykan Vanet     Red   80          960     68
6      renault 5  Silver   48          850     38

In [81]:
df.columns

Index(['model', 'Color', 'HP', 'Weight (KG)', 'price'], dtype='object')

In [82]:
type(df.columns)

pandas.core.indexes.base.Index

In [83]:
df.columns.tolist()

['model', 'Color', 'HP', 'Weight (KG)', 'price']

In [84]:
df.columns.to_numpy()

array(['model', 'Color', 'HP', 'Weight (KG)', 'price'], dtype=object)

In [85]:
df.index

RangeIndex(start=0, stop=7, step=1)

![](https://quera.org/qbox/view/xAhilaZMRL/col%20and%20index.gif)

In [86]:
df["Color"]

0       Red
1     White
2     Black
3     White
4      Blue
5       Red
6    Silver
Name: Color, dtype: object

In [87]:
df.iloc[0] #not df[0]

model          Peykan
Color             Red
HP                 48
Weight (KG)       990
price              33
Name: 0, dtype: object

![](https://quera.org/qbox/view/fUQOensQs0/both%20are%20series.gif)

In [88]:
df.values

array([['Peykan', 'Red', 48, 990, 33],
       ['BMW X6', 'White', 335, 2320, 2400],
       ['Peugeot 206', 'Black', 105, 1025, 105],
       ['Tiba', 'White', 87, 1027, 120],
       ['Nissan Junior', 'Blue', 93, 1540, 230],
       ['Peykan Vanet', 'Red', 80, 960, 68],
       ['renault 5', 'Silver', 48, 850, 38]], dtype=object)

In [89]:
df2 = pd.DataFrame([['Peykan', 'Red', 48, 990, 33],
       ['BMW X6', 'White', 335, 2320, 2400],
       ['Peugeot 206', 'Black', 105, 1025, 105],
       ['Tiba', 'White', 87, 1027, 120],
       ['Nissan Junior', 'Blue', 93, 1540, 230],
       ['Nissan Junior', 'Red', 93, 1540, 186],
       ['renault 5', 'Silver', 48, 850, 38]])
df2

               0       1    2     3     4
0         Peykan     Red   48   990    33
1         BMW X6   White  335  2320  2400
2    Peugeot 206   Black  105  1025   105
3           Tiba   White   87  1027   120
4  Nissan Junior    Blue   93  1540   230
5  Nissan Junior     Red   93  1540   186
6      renault 5  Silver   48   850    38

In [90]:
df2 = pd.DataFrame([['Peykan', 'Red', 48, 990, 33],
       ['BMW X6', 'White', 335, 2320, 2400],
       ['Peugeot 206', 'Black', 105, 1025, 105],
       ['Tiba', 'White', 87, 1027, 120],
       ['Nissan Junior', 'Blue', 93, 1540, 230],
       ['Nissan Junior', 'Red', 93, 1540, 186],
       ['renault 5', 'Silver', 48, 850, 38]],
       index = ['a','b','c','d','e','f','g'],
       columns= ['model' , 'Color' , 'HP', 'Weight (KG)', 'price'])
df2

           model   Color   HP  Weight (KG)  price
a         Peykan     Red   48          990     33
b         BMW X6   White  335         2320   2400
c    Peugeot 206   Black  105         1025    105
d           Tiba   White   87         1027    120
e  Nissan Junior    Blue   93         1540    230
f  Nissan Junior     Red   93         1540    186
g      renault 5  Silver   48          850     38

In [91]:
df.head()

           model  Color   HP  Weight (KG)  price
0         Peykan    Red   48          990     33
1         BMW X6  White  335         2320   2400
2    Peugeot 206  Black  105         1025    105
3           Tiba  White   87         1027    120
4  Nissan Junior   Blue   93         1540    230

In [92]:
df.tail()

           model   Color   HP  Weight (KG)  price
2    Peugeot 206   Black  105         1025    105
3           Tiba   White   87         1027    120
4  Nissan Junior    Blue   93         1540    230
5   Peykan Vanet     Red   80          960     68
6      renault 5  Silver   48          850     38

In [93]:
df.head(6)

           model  Color   HP  Weight (KG)  price
0         Peykan    Red   48          990     33
1         BMW X6  White  335         2320   2400
2    Peugeot 206  Black  105         1025    105
3           Tiba  White   87         1027    120
4  Nissan Junior   Blue   93         1540    230
5   Peykan Vanet    Red   80          960     68

In [126]:
df.sample(4 , random_state = 42)

              Color   HP  Weight (KG)  price
Peykan          Red   48          990     33
BMW X6        White  335         2320   2400
Peykan Vanet    Red   80          960     68
Peugeot 206   Black  105         1025    105

In [95]:
df.sample(frac=0.4 , random_state = 42)

          model  Color   HP  Weight (KG)  price
0        Peykan    Red   48          990     33
1        BMW X6  White  335         2320   2400
5  Peykan Vanet    Red   80          960     68

In [96]:
df.sample(frac=0.4, ignore_index=True , random_state = 42)

          model  Color   HP  Weight (KG)  price
0        Peykan    Red   48          990     33
1        BMW X6  White  335         2320   2400
2  Peykan Vanet    Red   80          960     68

In [97]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   model        7 non-null      object
 1   Color        7 non-null      object
 2   HP           7 non-null      int64
 3   Weight (KG)  7 non-null      int64
 4   price        7 non-null      int64
dtypes: int64(3), object(2)
memory usage: 412.0+ bytes

In [98]:
df.describe()

               HP  Weight (KG)        price
count    7.000000     7.000000     7.000000
mean   113.714286  1244.571429   427.714286
std     99.966185   522.948008   872.248572
min     48.000000   850.000000    33.000000
25%     64.000000   975.000000    53.000000
50%     87.000000  1025.000000   105.000000
75%     99.000000  1283.500000   175.000000
max    335.000000  2320.000000  2400.000000

In [99]:
df["Color"].value_counts()

Color
Red       2
White     2
Black     1
Blue      1
Silver    1
Name: count, dtype: int64

# Working with DataFrame

In [100]:
import pandas as pd
import numpy as np

cars_dictionary = {
    "Color" :["Red", "White", "Black", "White", "Blue", "Red", "Silver"],
    "HP" :[48, 335, 105, 87, 93, 80, 48],
    "Weight (KG)": [990, 2320, 1025, 1027, 1540, 960, 850],
    "price" :[33, 2400, 105, 120, 230, 68, 38]
}

df = pd.DataFrame(cars_dictionary , index = [ "Peykan", "BMW X6", "Peugeot 206", "Tiba", "Nissan Junior", "Peykan Vanet", "renault 5"])

df

                Color   HP  Weight (KG)  price
Peykan            Red   48          990     33
BMW X6          White  335         2320   2400
Peugeot 206     Black  105         1025    105
Tiba            White   87         1027    120
Nissan Junior    Blue   93         1540    230
Peykan Vanet      Red   80          960     68
renault 5      Silver   48          850     38

In [101]:
cars_dictionary["Color"]

['Red', 'White', 'Black', 'White', 'Blue', 'Red', 'Silver']

In [102]:
df["Color"]

Peykan              Red
BMW X6            White
Peugeot 206       Black
Tiba              White
Nissan Junior      Blue
Peykan Vanet        Red
renault 5        Silver
Name: Color, dtype: object

In [103]:
df.Color

Peykan              Red
BMW X6            White
Peugeot 206       Black
Tiba              White
Nissan Junior      Blue
Peykan Vanet        Red
renault 5        Silver
Name: Color, dtype: object

In [104]:
for c in df.columns:
    print(c)
    print(df[c].count())

Color
7
HP
7
Weight (KG)
7
price
7

In [105]:
df[["Color" , "price"]]

                Color  price
Peykan            Red     33
BMW X6          White   2400
Peugeot 206     Black    105
Tiba            White    120
Nissan Junior    Blue    230
Peykan Vanet      Red     68
renault 5      Silver     38

In [106]:
df.iloc[2]

Color          Black
HP               105
Weight (KG)     1025
price            105
Name: Peugeot 206, dtype: object

In [107]:
df.loc["Tiba"]

Color          White
HP                87
Weight (KG)     1027
price            120
Name: Tiba, dtype: object

![](https://quera.org/qbox/view/tlgYHWnNKC/loc%20iloc%20v2.gif)

In [108]:
cars_dictionary = {
    "Color" :["Red", "White", "Black", "White", "Blue", "Red", "Silver"],
    "HP" :[48, 335, 105, 87, 93, 80, 48],
    "Weight (KG)": [990, 2320, 1025, 1027, 1540, 960, 850],
    "price" :[33, 2400, 105, 120, 230, 68, 38]
}

df2 = pd.DataFrame(cars_dictionary )

df2

    Color   HP  Weight (KG)  price
0     Red   48          990     33
1   White  335         2320   2400
2   Black  105         1025    105
3   White   87         1027    120
4    Blue   93         1540    230
5     Red   80          960     68
6  Silver   48          850     38

In [109]:
df2.loc[3]

Color          White
HP                87
Weight (KG)     1027
price            120
Name: 3, dtype: object

In [110]:
arr = np.arange(16).reshape(4, 4)
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [111]:
arr[2,3]

np.int64(11)

In [112]:
df

                Color   HP  Weight (KG)  price
Peykan            Red   48          990     33
BMW X6          White  335         2320   2400
Peugeot 206     Black  105         1025    105
Tiba            White   87         1027    120
Nissan Junior    Blue   93         1540    230
Peykan Vanet      Red   80          960     68
renault 5      Silver   48          850     38

In [113]:
df.iloc[2,3]

np.int64(105)

In [114]:
df.iloc[[2,3], 1:3]

              HP  Weight (KG)
Peugeot 206  105         1025
Tiba          87         1027

In [115]:
df.loc["Peugeot 206", "price"]

np.int64(105)

In [116]:
df.loc[["Peugeot 206","Tiba"] , "HP":"price"]

              HP  Weight (KG)  price
Peugeot 206  105         1025    105
Tiba          87         1027    120

---

In [117]:
import pandas as pd
import numpy as np

cars_dictionary = {
    "Color" :["Red", "White", "Black", "White", "Blue", "Red", "Silver"],
    "HP" :[48, 335, 105, 87, 93, 80, 48],
    "Weight (KG)": [990, 2320, 1025, 1027, 1540, 960, 850],
    "price" :[33, 2400, 105, 120, 230, 68, 38]
}

df = pd.DataFrame(cars_dictionary , index = [ "Peykan", "BMW X6", "Peugeot 206", "Tiba", "Nissan Junior", "Peykan Vanet", "renault 5"])

df

                Color   HP  Weight (KG)  price
Peykan            Red   48          990     33
BMW X6          White  335         2320   2400
Peugeot 206     Black  105         1025    105
Tiba            White   87         1027    120
Nissan Junior    Blue   93         1540    230
Peykan Vanet      Red   80          960     68
renault 5      Silver   48          850     38

In [118]:
df.price

Peykan             33
BMW X6           2400
Peugeot 206       105
Tiba              120
Nissan Junior     230
Peykan Vanet       68
renault 5          38
Name: price, dtype: int64

In [119]:
df.price > 110

Peykan           False
BMW X6            True
Peugeot 206      False
Tiba              True
Nissan Junior     True
Peykan Vanet     False
renault 5        False
Name: price, dtype: bool

In [120]:
df[df.price > 110]

               Color   HP  Weight (KG)  price
BMW X6         White  335         2320   2400
Tiba           White   87         1027    120
Nissan Junior   Blue   93         1540    230

![](https://quera.org/qbox/view/rHA0rGQKi0/sharti.gif)

In [121]:
df[ (df.Color == "Red") & (df.price < 50)]

       Color  HP  Weight (KG)  price
Peykan   Red  48          990     33

In [122]:
df[df.price > 110][["Color" , "price"]]

               Color  price
BMW X6         White   2400
Tiba           White    120
Nissan Junior   Blue    230

In [123]:
condition_1 = df.Color == "Red"
condition_2 = df.Color == "White"
condition_3 = df.HP < 100

df[(condition_1) | ((condition_2) & condition_3)]

              Color  HP  Weight (KG)  price
Peykan          Red  48          990     33
Tiba          White  87         1027    120
Peykan Vanet    Red  80          960     68

# Working with CSV file

In [124]:
import pandas as pd
df = pd.read_csv("/Users/mac/Desktop/Sample.csv")

FileNotFoundError: [Errno 2] No such file or directory: '/Users/mac/Desktop/Sample.csv'

In [2]:
df

,Period,Inst_sector,Inst_sector_code,Descriptor,SNA08TRANS,Asset_liability_code,Values
0,2007.03,Non-corporate business enterprises,121,Closing balance total assets,LE00000,A000000,345973
1,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance total financi...,LE00000,AFA0000,99770
2,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance monetary gold...,LE00000,AFA0100,0
3,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance currency and ...,LE00000,AFA0200,14773
4,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance debt securities,LE00000,AFA0300,1267
...,...,...,...,...,...,...,...
6550,2021.03,Total all sectors,900,Financial liabilities Closing balance other ac...,LE00000,AFL0800,189843
6551,2021.03,Total all sectors,900,Financial assets Closing balance produced non-...,LE00000,AN10000,1122154
6552,2021.03,Total all sectors,900,Financial assets Closing balance non-produced ...,LE00000,AN20000,1495556
6553,2021.03,Total all sectors,900,Closing balance net worth,LE00000,B900000,2617710
6554,2021.03,Total all sectors,900,Closing balance total liabilities and net worth,LE00000,L000000,6678433

__Parameters__
- sep (seperator as default is ",")
- header (how many first rows are valid to be column's name)
- index_col (this one decides which column is index for dataframe)
- na_values 
- encoding
- parse_date

In [2]:
%pip install lxml

Collecting lxml
  Downloading lxml-5.3.0-cp313-cp313-win_amd64.whl.metadata (3.9 kB)
Downloading lxml-5.3.0-cp313-cp313-win_amd64.whl (3.8 MB)
   ---------------------------------------- 0.0/3.8 MB ? eta -:--:--
   ---------------------------------------- 0.0/3.8 MB ? eta -:--:--
   ---------------------------------------- 0.0/3.8 MB ? eta -:--:--
   -- ------------------------------------- 0.3/3.8 MB ? eta -:--:--
   -- ------------------------------------- 0.3/3.8 MB ? eta -:--:--
   ----- ---------------------------------- 0.5/3.8 MB 628.3 kB/s eta 0:00:06
   ----- ---------------------------------- 0.5/3.8 MB 628.3 kB/s eta 0:00:06
   -------- ------------------------------- 0.8/3.8 MB 627.3 kB/s eta 0:00:05
   -------- ------------------------------- 0.8/3.8 MB 627.3 kB/s eta 0:00:05
   ---------- ----------------------------- 1.0/3.8 MB 625.8 kB/s eta 0:00:05
   ---------- ----------------------------- 1.0/3.8 MB 625.8 kB/s eta 0:00:05
   ------------- -------------------------- 1.3/3.8 MB 626.6 kB/s eta 0:00:04
   ------------- -------------------------- 1.3/3.8 MB 626.6 kB/s eta 0:00:04
   ---------------- ----------------------- 1.6/3.8 MB 627.3 kB/s eta 0:00:04
   ---------------- ----------------------- 1.6/3.8 MB 627.3 kB/s eta 0:00:04
   ------------------- -------------------- 1.8/3.8 MB 627.0 kB/s eta 0:00:04
   ------------------- -------------------- 1.8/3.8 MB 627.0 kB/s eta 0:00:04
   --------------------- ------------------ 2.1/3.8 MB 626.7 kB/s eta 0:00:03
   --------------------- ------------------ 2.1/3.8 MB 626.7 kB/s eta 0:00:03
   ------------------------ --------------- 2.4/3.8 MB 627.6 kB/s eta 0:00:03
   ------------------------ --------------- 2.4/3.8 MB 627.6 kB/s eta 0:00:03
   --------------------------- ------------ 2.6/3.8 MB 627.4 kB/s eta 0:00:02
   --------------------------- ------------ 2.6/3.8 MB 627.4 kB/s eta 0:00:02
   ------------------------------ --------- 2.9/3.8 MB 627.2 kB/s eta 0:00:02
   ------------------------------ --------- 2.9/3.8 MB 627.2 kB/s eta 0:00:02
   -------------------------------- ------- 3.1/3.8 MB 626.6 kB/s eta 0:00:02
   -------------------------------- ------- 3.1/3.8 MB 626.6 kB/s eta 0:00:02
   ----------------------------------- ---- 3.4/3.8 MB 626.8 kB/s eta 0:00:01
   ----------------------------------- ---- 3.4/3.8 MB 626.8 kB/s eta 0:00:01
   -------------------------------------- - 3.7/3.8 MB 626.7 kB/s eta 0:00:01
   ---------------------------------------- 3.8/3.8 MB 627.7 kB/s eta 0:00:00
Installing collected packages: lxml
Successfully installed lxml-5.3.0
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd
  
html_string = '''
  <table>
  <tr>    
    <th>Company</th>
    <th>Contact</th>
    <th>Country</th>
  </tr>
  <tr>
    <td>Alfreds Futterkiste</td>
    <td>Maria Anders</td>
    <td>Germany</td>
  </tr>
  <tr>
    <td>Centro comercial Moctezuma</td>
    <td>Francisco Chang</td>
    <td>Mexico</td>
  </tr>
</table>
'''
df_1 = pd.read_html(html_string)
df_1

C:\Users\Shayan\AppData\Local\Temp\ipykernel_22772\975393114.py:22: FutureWarning: Passing literal html to 'read_html' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  df_1 = pd.read_html(html_string)

[                      Company          Contact  Country
 0         Alfreds Futterkiste     Maria Anders  Germany
 1  Centro comercial Moctezuma  Francisco Chang   Mexico]

# Creating CSV file

In [ ]:
DataFrame.to_csv(path, index=True)

# Apply functions and Sorting

In [1]:
import pandas as pd

In [9]:
df = pd.DataFrame()
df['col_1'] = [1,4,9,16]
df['col_2'] = [25,36,49,64]
df

   col_1  col_2
0      1     25
1      4     36
2      9     49
3     16     64

In [10]:
def sum_row (row) :
    return row['col_2'] + row['col_1']

df['sum'] = df.apply(sum_row, axis=1)
df

   col_1  col_2  sum
0      1     25   26
1      4     36   40
2      9     49   58
3     16     64   80

In [11]:
df.drop(['sum'], axis=1, inplace=True)
df['sum'] = df.apply(lambda row : row['col_1'] + row['col_2'], axis=1)
df

   col_1  col_2  sum
0      1     25   26
1      4     36   40
2      9     49   58
3     16     64   80

In [12]:
import numpy as np
df.drop(['sum'], axis=1, inplace=True)
df.apply(np.sum)

col_1     30
col_2    174
dtype: int64

In [13]:
def row_divide_2 (row) :
  return row / 2 
df.apply(row_divide_2, axis=1)

   col_1  col_2
0    0.5   12.5
1    2.0   18.0
2    4.5   24.5
3    8.0   32.0

In [14]:
def col_divide_2 (col) : 
    return col / 2 

df.apply(col_divide_2)

   col_1  col_2
0    0.5   12.5
1    2.0   18.0
2    4.5   24.5
3    8.0   32.0

In [15]:
df/2

   col_1  col_2
0    0.5   12.5
1    2.0   18.0
2    4.5   24.5
3    8.0   32.0

## Sort Values

In [16]:
stu_dictionary = {
    "name" : ["PARTO", "parsa", "SAJJAD", "hadi", "MOHSEN", "ghazale", "hamed"] ,
    "stu_number" : ["963613060", "963613061", "963613062", "963613063", "963613064", "963613065", "933613080"] ,
    "average" : [19.68,19.90,17.27, 19.5, 15.9, 18.2, 19.34]
}
df = pd.DataFrame(stu_dictionary)
df

      name stu_number  average
0    PARTO  963613060    19.68
1    parsa  963613061    19.90
2   SAJJAD  963613062    17.27
3     hadi  963613063    19.50
4   MOHSEN  963613064    15.90
5  ghazale  963613065    18.20
6    hamed  933613080    19.34

In [17]:
df.sort_values(by='average', ascending=False)

      name stu_number  average
1    parsa  963613061    19.90
0    PARTO  963613060    19.68
3     hadi  963613063    19.50
6    hamed  933613080    19.34
5  ghazale  963613065    18.20
2   SAJJAD  963613062    17.27
4   MOHSEN  963613064    15.90

In [18]:
df.sort_values('name')

      name stu_number  average
4   MOHSEN  963613064    15.90
0    PARTO  963613060    19.68
2   SAJJAD  963613062    17.27
5  ghazale  963613065    18.20
3     hadi  963613063    19.50
6    hamed  933613080    19.34
1    parsa  963613061    19.90

In [19]:
df.sort_values(by='name', key=lambda name : name.str.lower())

      name stu_number  average
5  ghazale  963613065    18.20
3     hadi  963613063    19.50
6    hamed  933613080    19.34
4   MOHSEN  963613064    15.90
1    parsa  963613061    19.90
0    PARTO  963613060    19.68
2   SAJJAD  963613062    17.27

# Merging

In [20]:
import pandas as pd
import numpy as np
cars_dictionary = {
    "model" :["Peykan", "Peykan", "Peykan", "BMW X6", "BMW X6", "Nissan Junior", "Nissan Junior", "Nissan Junior", "Nissan Junior"],
    "Color" :["Red", "White", "Olive",  "Black", "Ametrine", "Blue", "White", "Blue", "Red"],
    "HP" :[48, 48, 48, 335, 335, 93, 93, 93, 93],
    "Weight (KG)" :[990, 990, 990, 2320, 2320, 1540, 1540, 1540, 1540],
    "year" :[1346, 1357, 1388, 1391, 1393, 1375, 1383, 1375, 1389]
}

cars_df = pd.DataFrame(cars_dictionary,
                      index = [14234, 44234, 22312, 42348, 16373, 38561, 58193, 85612, 62471])
cars_df

               model     Color   HP  Weight (KG)  year
14234         Peykan       Red   48          990  1346
44234         Peykan     White   48          990  1357
22312         Peykan     Olive   48          990  1388
42348         BMW X6     Black  335         2320  1391
16373         BMW X6  Ametrine  335         2320  1393
38561  Nissan Junior      Blue   93         1540  1375
58193  Nissan Junior     White   93         1540  1383
85612  Nissan Junior      Blue   93         1540  1375
62471  Nissan Junior       Red   93         1540  1389

In [21]:
price_dictionary = {
    "model" : ["Peykan", "BMW X6", "Nissan Junior"],
    "price" : [40, 5200, 150]
}
price_df = pd.DataFrame(price_dictionary)
price_df

           model  price
0         Peykan     40
1         BMW X6   5200
2  Nissan Junior    150

In [22]:
pd.merge(cars_df, price_df)

           model     Color   HP  Weight (KG)  year  price
0         Peykan       Red   48          990  1346     40
1         Peykan     White   48          990  1357     40
2         Peykan     Olive   48          990  1388     40
3         BMW X6     Black  335         2320  1391   5200
4         BMW X6  Ametrine  335         2320  1393   5200
5  Nissan Junior      Blue   93         1540  1375    150
6  Nissan Junior     White   93         1540  1383    150
7  Nissan Junior      Blue   93         1540  1375    150
8  Nissan Junior       Red   93         1540  1389    150

![](https://quera.org/qbox/view/qQxIManHoo/merge.gif)

## don't forget indexes

In [23]:
new_df = cars_df.reset_index()
new_df

   index          model     Color   HP  Weight (KG)  year
0  14234         Peykan       Red   48          990  1346
1  44234         Peykan     White   48          990  1357
2  22312         Peykan     Olive   48          990  1388
3  42348         BMW X6     Black  335         2320  1391
4  16373         BMW X6  Ametrine  335         2320  1393
5  38561  Nissan Junior      Blue   93         1540  1375
6  58193  Nissan Junior     White   93         1540  1383
7  85612  Nissan Junior      Blue   93         1540  1375
8  62471  Nissan Junior       Red   93         1540  1389

In [24]:
pd.merge(new_df, price_df)

   index          model     Color   HP  Weight (KG)  year  price
0  14234         Peykan       Red   48          990  1346     40
1  44234         Peykan     White   48          990  1357     40
2  22312         Peykan     Olive   48          990  1388     40
3  42348         BMW X6     Black  335         2320  1391   5200
4  16373         BMW X6  Ametrine  335         2320  1393   5200
5  38561  Nissan Junior      Blue   93         1540  1375    150
6  58193  Nissan Junior     White   93         1540  1383    150
7  85612  Nissan Junior      Blue   93         1540  1375    150
8  62471  Nissan Junior       Red   93         1540  1389    150

In [25]:
price_dictionary2 = {
    "car model" : ["Peykan", "BMW X6", "Nissan Junior"],
    "price" : [40, 5200, 150]
}
price_df2 = pd.DataFrame(price_dictionary2)
price_df2

       car model  price
0         Peykan     40
1         BMW X6   5200
2  Nissan Junior    150

In [26]:
merged = pd.merge(cars_df, price_df2, left_on = "model", right_on = "car model") 
merged

           model     Color   HP  Weight (KG)  year      car model  price
0         Peykan       Red   48          990  1346         Peykan     40
1         Peykan     White   48          990  1357         Peykan     40
2         Peykan     Olive   48          990  1388         Peykan     40
3         BMW X6     Black  335         2320  1391         BMW X6   5200
4         BMW X6  Ametrine  335         2320  1393         BMW X6   5200
5  Nissan Junior      Blue   93         1540  1375  Nissan Junior    150
6  Nissan Junior     White   93         1540  1383  Nissan Junior    150
7  Nissan Junior      Blue   93         1540  1375  Nissan Junior    150
8  Nissan Junior       Red   93         1540  1389  Nissan Junior    150

In [27]:
merged.drop(columns = ["car model"])

           model     Color   HP  Weight (KG)  year  price
0         Peykan       Red   48          990  1346     40
1         Peykan     White   48          990  1357     40
2         Peykan     Olive   48          990  1388     40
3         BMW X6     Black  335         2320  1391   5200
4         BMW X6  Ametrine  335         2320  1393   5200
5  Nissan Junior      Blue   93         1540  1375    150
6  Nissan Junior     White   93         1540  1383    150
7  Nissan Junior      Blue   93         1540  1375    150
8  Nissan Junior       Red   93         1540  1389    150

In [28]:
price_with_year_dictionary = {
    "year" :[1346, 1357, 1388, 1391, 1393,  1375, 1383, 1389],
    "car model" :["Peykan", "Peykan", "Peykan", "BMW X6", "BMW X6", "Nissan Junior", "Nissan Junior", "Nissan Junior"],
    "price" :[25, 30, 48, 2200, 4800, 105, 130, 155]
}

price_with_year_df = pd.DataFrame(price_with_year_dictionary)
price_with_year_df

   year      car model  price
0  1346         Peykan     25
1  1357         Peykan     30
2  1388         Peykan     48
3  1391         BMW X6   2200
4  1393         BMW X6   4800
5  1375  Nissan Junior    105
6  1383  Nissan Junior    130
7  1389  Nissan Junior    155

In [29]:
pd.merge(cars_df, price_with_year_df, left_on = ["model" , "year"], right_on = ["car model", "year"])

           model     Color   HP  Weight (KG)  year      car model  price
0         Peykan       Red   48          990  1346         Peykan     25
1         Peykan     White   48          990  1357         Peykan     30
2         Peykan     Olive   48          990  1388         Peykan     48
3         BMW X6     Black  335         2320  1391         BMW X6   2200
4         BMW X6  Ametrine  335         2320  1393         BMW X6   4800
5  Nissan Junior      Blue   93         1540  1375  Nissan Junior    105
6  Nissan Junior      Blue   93         1540  1375  Nissan Junior    105
7  Nissan Junior     White   93         1540  1383  Nissan Junior    130
8  Nissan Junior       Red   93         1540  1389  Nissan Junior    155

![]("https://quera.org/qbox/view/EYndiRyaWi/merge2.gif")

In [31]:
price_dictionary3 = {
    "HP" :[40, 330, 87],
    "price" :[48, 2200, 105]
}

price_df3 = pd.DataFrame(price_dictionary3,
                        index = ["Peykan", "BMW X6", "Nissan Junior"])
price_df3

                HP  price
Peykan          40     48
BMW X6         330   2200
Nissan Junior   87    105

In [32]:
pd.merge(cars_df, price_df3, left_on = "model" , right_index = True)

               model     Color  HP_x  Weight (KG)  year  HP_y  price
14234         Peykan       Red    48          990  1346    40     48
44234         Peykan     White    48          990  1357    40     48
22312         Peykan     Olive    48          990  1388    40     48
42348         BMW X6     Black   335         2320  1391   330   2200
16373         BMW X6  Ametrine   335         2320  1393   330   2200
38561  Nissan Junior      Blue    93         1540  1375    87    105
58193  Nissan Junior     White    93         1540  1383    87    105
85612  Nissan Junior      Blue    93         1540  1375    87    105
62471  Nissan Junior       Red    93         1540  1389    87    105

In [33]:
pd.merge(cars_df, price_df3, left_on = "model" , right_index = True, suffixes=('_gallery', '_web'))

               model     Color  HP_gallery  Weight (KG)  year  HP_web  price
14234         Peykan       Red          48          990  1346      40     48
44234         Peykan     White          48          990  1357      40     48
22312         Peykan     Olive          48          990  1388      40     48
42348         BMW X6     Black         335         2320  1391     330   2200
16373         BMW X6  Ametrine         335         2320  1393     330   2200
38561  Nissan Junior      Blue          93         1540  1375      87    105
58193  Nissan Junior     White          93         1540  1383      87    105
85612  Nissan Junior      Blue          93         1540  1375      87    105
62471  Nissan Junior       Red          93         1540  1389      87    105

In [34]:
full_cars_dictionary = {
    "model" :["Peykan", "Peykan", "Peykan", "BMW X6", "Nissan Junior", "Pride 131", "Pride 131"],
    "Color" :["Red", "White", "Olive", "White", "Black", "Ametrine", "Blue"],
    "HP" :[48, 48, 48, 335, 93, 71, 71],
    "Weight (KG)" :[990, 990, 990, 2320, 1540, 915, 915]
}

full_cars_df = pd.DataFrame(full_cars_dictionary)
full_cars_df

           model     Color   HP  Weight (KG)
0         Peykan       Red   48          990
1         Peykan     White   48          990
2         Peykan     Olive   48          990
3         BMW X6     White  335         2320
4  Nissan Junior     Black   93         1540
5      Pride 131  Ametrine   71          915
6      Pride 131      Blue   71          915

In [35]:
full_price_dictionary = {
    "model" :["Peykan", "BMW X6", "Nissan Junior", "Dena"],
    "price" :[37, 4800, 105, 380]
}

full_price_df = pd.DataFrame(full_price_dictionary)
full_price_df

           model  price
0         Peykan     37
1         BMW X6   4800
2  Nissan Junior    105
3           Dena    380

In [36]:
pd.merge(full_cars_df, full_price_df)

           model  Color   HP  Weight (KG)  price
0         Peykan    Red   48          990     37
1         Peykan  White   48          990     37
2         Peykan  Olive   48          990     37
3         BMW X6  White  335         2320   4800
4  Nissan Junior  Black   93         1540    105

![](https://quera.org/qbox/view/LNNEr75TC2/merge3.gif)

In [37]:
pd.merge(full_cars_df, full_price_df, how = "left")

           model     Color   HP  Weight (KG)   price
0         Peykan       Red   48          990    37.0
1         Peykan     White   48          990    37.0
2         Peykan     Olive   48          990    37.0
3         BMW X6     White  335         2320  4800.0
4  Nissan Junior     Black   93         1540   105.0
5      Pride 131  Ametrine   71          915     NaN
6      Pride 131      Blue   71          915     NaN

# Concat

In [1]:
import pandas as pd
import numpy as np
dictionary1 = {
    "model" :["Peykan", "Peykan", "BMW X6", "Nissan Junior", "Nissan Junior"],
    "Color" :["Red","Olive", "Ametrine", "White", "Red"],
    "HP" :[48, 48, 335, 93, 93],
    "Weight (KG)" :[990, 990, 2320, 1540, 1540],
    "year" :[1346, 1388, 1393, 1383, 1389]
}
df1 = pd.DataFrame(dictionary1)
df1

           model     Color   HP  Weight (KG)  year
0         Peykan       Red   48          990  1346
1         Peykan     Olive   48          990  1388
2         BMW X6  Ametrine  335         2320  1393
3  Nissan Junior     White   93         1540  1383
4  Nissan Junior       Red   93         1540  1389

In [2]:
dictionary2 = {
    "model" :["Peykan", "BMW X6", "Nissan Junior", "Nissan Junior"],
    "Color" :["White", "Black", "Blue", "Blue"],
    "Weight (KG)" :[990, 2320, 1540, 1540],
    "year" :[1357, 1391, 1375, 1375]
}
df2 = pd.DataFrame(dictionary2)
df2

           model  Color  Weight (KG)  year
0         Peykan  White          990  1357
1         BMW X6  Black         2320  1391
2  Nissan Junior   Blue         1540  1375
3  Nissan Junior   Blue         1540  1375

In [3]:
a = pd.concat([df1, df2], axis=0)
a

           model     Color     HP  Weight (KG)  year
0         Peykan       Red   48.0          990  1346
1         Peykan     Olive   48.0          990  1388
2         BMW X6  Ametrine  335.0         2320  1393
3  Nissan Junior     White   93.0         1540  1383
4  Nissan Junior       Red   93.0         1540  1389
0         Peykan     White    NaN          990  1357
1         BMW X6     Black    NaN         2320  1391
2  Nissan Junior      Blue    NaN         1540  1375
3  Nissan Junior      Blue    NaN         1540  1375

![](https://quera.org/qbox/view/PHA1ljglQI/concat1.gif)

In [4]:
a.reset_index().drop(columns=['index'])

           model     Color     HP  Weight (KG)  year
0         Peykan       Red   48.0          990  1346
1         Peykan     Olive   48.0          990  1388
2         BMW X6  Ametrine  335.0         2320  1393
3  Nissan Junior     White   93.0         1540  1383
4  Nissan Junior       Red   93.0         1540  1389
5         Peykan     White    NaN          990  1357
6         BMW X6     Black    NaN         2320  1391
7  Nissan Junior      Blue    NaN         1540  1375
8  Nissan Junior      Blue    NaN         1540  1375

In [5]:
dictionary1 = {
    "model" :["Peykan", "Peykan", "Peykan", "BMW X6", "BMW X6", "Nissan Junior", "Nissan Junior", "Nissan Junior", "Nissan Junior"],
    "Color" :["Red", "White", "Olive",  "Black", "Ametrine", "Blue", "White", "Blue", "Red"],
    "HP" :[48, 48, 48, 335, 335, 93, 93, 93, 93]
}
df1 = pd.DataFrame(dictionary1)
df1

           model     Color   HP
0         Peykan       Red   48
1         Peykan     White   48
2         Peykan     Olive   48
3         BMW X6     Black  335
4         BMW X6  Ametrine  335
5  Nissan Junior      Blue   93
6  Nissan Junior     White   93
7  Nissan Junior      Blue   93
8  Nissan Junior       Red   93

In [6]:
dictionary2 = {
    "Weight (KG)" :[990, 990, 990, 2320, 2320, 1540, 1540],
    "year" :[1346, 1357, 1388, 1391, 1393, 1375, 1383]
}
df2 = pd.DataFrame(dictionary2)
df2

   Weight (KG)  year
0          990  1346
1          990  1357
2          990  1388
3         2320  1391
4         2320  1393
5         1540  1375
6         1540  1383

In [7]:
pd.concat([df1, df2], axis=1)

           model     Color   HP  Weight (KG)    year
0         Peykan       Red   48        990.0  1346.0
1         Peykan     White   48        990.0  1357.0
2         Peykan     Olive   48        990.0  1388.0
3         BMW X6     Black  335       2320.0  1391.0
4         BMW X6  Ametrine  335       2320.0  1393.0
5  Nissan Junior      Blue   93       1540.0  1375.0
6  Nissan Junior     White   93       1540.0  1383.0
7  Nissan Junior      Blue   93          NaN     NaN
8  Nissan Junior       Red   93          NaN     NaN

![](https://quera.org/qbox/view/YufD4vc7HF/concat2.gif)

In [9]:
staff1_dictionary = {
    "model" :["Peykan", np.nan, "Peykan", "BMW X6", "BMW X6", np.nan, "Nissan Junior", "Nissan Junior", "Nissan Junior"],
    "Color" :["Red", "White", "Olive",  "Black", np.nan, "Blue", "White", "Blue", "Red"],
    "HP" :[48, np.nan, 48, 335, 335, np.nan, 93, np.nan, 93],
    "Weight (KG)" :[np.nan, 990, 990, 2320, np.nan, 1540, 1540, 1540, np.nan],
    "year" :[1346, np.nan, 1388, 1391, 1393, 1375, np.nan, 1375, 1389]
}

staff1_df = pd.DataFrame(staff1_dictionary, 
                      index = [14234, 44234, 22312, 42348, 16373, 38561, 58193, 85612, 62471])
staff1_df

               model  Color     HP  Weight (KG)    year
14234         Peykan    Red   48.0          NaN  1346.0
44234            NaN  White    NaN        990.0     NaN
22312         Peykan  Olive   48.0        990.0  1388.0
42348         BMW X6  Black  335.0       2320.0  1391.0
16373         BMW X6    NaN  335.0          NaN  1393.0
38561            NaN   Blue    NaN       1540.0  1375.0
58193  Nissan Junior  White   93.0       1540.0     NaN
85612  Nissan Junior   Blue    NaN       1540.0  1375.0
62471  Nissan Junior    Red   93.0          NaN  1389.0

In [10]:
staff2_dictionary = {
    "model" :[np.nan, "Peykan", "Peykan", np.nan, "BMW X5", "Nissan Junior", "Nissan Junior", "Nissan Junior", "Nissan Junior"],
    "Color" :["Red", "White", "Green",  "Black", "Ametrine", np.nan, "Gray", "Navy", np.nan],
    "HP" :[48, 48, 48, np.nan, 335, 93, np.nan, 93, 93],
    "Weight (KG)" :[np.nan, 990, 990, np.nan, 2320, 1540, 1540, 1540, np.nan],
    "year" :[np.nan, 1357, 1388, 1391, 1393, 1375, 1383, np.nan, 1389]
}

staff2_df = pd.DataFrame(staff2_dictionary, 
                      index = [14234, 44234, 22312, 42348, 16373, 38561, 58193, 85612, 62471])
staff2_df

               model     Color     HP  Weight (KG)    year
14234            NaN       Red   48.0          NaN     NaN
44234         Peykan     White   48.0        990.0  1357.0
22312         Peykan     Green   48.0        990.0  1388.0
42348            NaN     Black    NaN          NaN  1391.0
16373         BMW X5  Ametrine  335.0       2320.0  1393.0
38561  Nissan Junior       NaN   93.0       1540.0  1375.0
58193  Nissan Junior      Gray    NaN       1540.0  1383.0
85612  Nissan Junior      Navy   93.0       1540.0     NaN
62471  Nissan Junior       NaN   93.0          NaN  1389.0

In [11]:
staff1_df.combine_first(staff2_df)

               model     Color     HP  Weight (KG)    year
14234         Peykan       Red   48.0          NaN  1346.0
44234         Peykan     White   48.0        990.0  1357.0
22312         Peykan     Olive   48.0        990.0  1388.0
42348         BMW X6     Black  335.0       2320.0  1391.0
16373         BMW X6  Ametrine  335.0       2320.0  1393.0
38561  Nissan Junior      Blue   93.0       1540.0  1375.0
58193  Nissan Junior     White   93.0       1540.0  1383.0
85612  Nissan Junior      Blue   93.0       1540.0  1375.0
62471  Nissan Junior       Red   93.0          NaN  1389.0

![](https://quera.org/qbox/view/gsYC5w83a9/overlap.gif)

# Grouping

In [12]:
import pandas as pd
import numpy as np
cars_dictionary = {
    "model" :["Peykan", "Peykan", "Peykan", "BMW X6", "BMW X6", "BMW X6", "Nissan Junior", "Nissan Junior", "Nissan Junior", "Nissan Junior"],
    "Color" :["Red", "White", "Olive",  "Black", "Ametrine", "navy", "Blue", "White", "Blue", "Red"],
    "Weight (KG)" :[990, 1000, 990, 2320, 2320, 2220, 1540, 1540, 1600, 1540],
    "year" :[1346, 1357, 1388, 1391, 1393, 1393, 1375, 1383, 1375, 1389],
    "price" :[25, 30, 48, 2200, 4800, 4800, 105, 105, 130, 145]
}

cars_df = pd.DataFrame(cars_dictionary)
cars_df

           model     Color  Weight (KG)  year  price
0         Peykan       Red          990  1346     25
1         Peykan     White         1000  1357     30
2         Peykan     Olive          990  1388     48
3         BMW X6     Black         2320  1391   2200
4         BMW X6  Ametrine         2320  1393   4800
5         BMW X6      navy         2220  1393   4800
6  Nissan Junior      Blue         1540  1375    105
7  Nissan Junior     White         1540  1383    105
8  Nissan Junior      Blue         1600  1375    130
9  Nissan Junior       Red         1540  1389    145

In [13]:
df = cars_df[cars_df.model == 'BMW X6']
df

    model     Color  Weight (KG)  year  price
3  BMW X6     Black         2320  1391   2200
4  BMW X6  Ametrine         2320  1393   4800
5  BMW X6      navy         2220  1393   4800

In [14]:
df['price'].mean()

3933.3333333333335

In [15]:
grouped = cars_df.groupby('model')
type(grouped)

pandas.core.groupby.generic.DataFrameGroupBy

In [16]:
grouped.ngroups

3

In [17]:
grouped.groups

{'BMW X6': [3, 4, 5], 'Nissan Junior': [6, 7, 8, 9], 'Peykan': [0, 1, 2]}

In [18]:
grouped.size()

model
BMW X6           3
Nissan Junior    4
Peykan           3
dtype: int64

In [19]:
grouped[['price','Weight (KG)']].agg('mean')

                     price  Weight (KG)
model
BMW X6         3933.333333  2286.666667
Nissan Junior   121.250000  1555.000000
Peykan           34.333333   993.333333

In [20]:
 def peak_to_peak(arr):
     return arr.max() - arr.min()

grouped[['price','Weight (KG)']].agg( peak_to_peak )

               price  Weight (KG)
model
BMW X6          2600          100
Nissan Junior     40           60
Peykan            23           10

In [21]:
grouped['price'].agg(['count', peak_to_peak, 'median', 'mean'])

               count  peak_to_peak  median         mean
model
BMW X6             3          2600  4800.0  3933.333333
Nissan Junior      4            40   117.5   121.250000
Peykan             3            23    30.0    34.333333

In [22]:
car_impact = ['low', 'high', 'medium', 'high', 'low', 'medium', 'medium', 'low', 'low', 'high']
cars_df.groupby(car_impact)['price'].agg(['min', 'max'])

        min   max
high     30  2200
low      25  4800
medium   48  4800

In [23]:
cars_df.index = [3523, 2636, 1031, 2159, 2973, 1083, 3214, 1111, 2525, 2445]

def factor_split(number):
    return np.array(number/1000).astype(int)

factor_split(cars_df.index)

array([3, 2, 1, 2, 2, 1, 3, 1, 2, 2])

In [24]:
cars_df.groupby(factor_split)['price'].sum()

1    4953
2    7305
3     130
Name: price, dtype: int64

In [25]:
price_datas = cars_df.groupby(['model', 'year'])['price'].mean()
price_datas

model          year
BMW X6         1391    2200.0
               1393    4800.0
Nissan Junior  1375     117.5
               1383     105.0
               1389     145.0
Peykan         1346      25.0
               1357      30.0
               1388      48.0
Name: price, dtype: float64

In [26]:
price_datas.unstack()

year           1346  1357   1375   1383  1388   1389    1391    1393
model
BMW X6          NaN   NaN    NaN    NaN   NaN    NaN  2200.0  4800.0
Nissan Junior   NaN   NaN  117.5  105.0   NaN  145.0     NaN     NaN
Peykan         25.0  30.0    NaN    NaN  48.0    NaN     NaN     NaN

# Transform & Filter

In [27]:
import pandas as pd
import numpy as np
cars_dictionary = {
    "model" :["Peykan", "Peykan", "Peykan", "BMW X6", "BMW X6", "BMW X6", "Nissan Junior", "Nissan Junior", "Nissan Junior", "Nissan Junior"],
    "Color" :["Red", "White", "Olive",  "Black", "Ametrine", "navy", "Blue", "White", "Blue", "Red"],
    "Weight (KG)" :[990, 1000, 990, 2320, 2320, 2220, 1540, 1540, 1600, 1540],
    "year" :[1346, 1357, 1388, 1391, 1393, 1393, 1375, 1383, 1375, 1389],
    "price" :[25, 30, 48, 2200, 4800, 4800, 105, 105, 130, 145]
}

cars_df = pd.DataFrame(cars_dictionary , index = [3523, 2636, 1031, 2159, 2973, 1083, 3214, 1111, 2525, 2445])
cars_df

              model     Color  Weight (KG)  year  price
3523         Peykan       Red          990  1346     25
2636         Peykan     White         1000  1357     30
1031         Peykan     Olive          990  1388     48
2159         BMW X6     Black         2320  1391   2200
2973         BMW X6  Ametrine         2320  1393   4800
1083         BMW X6      navy         2220  1393   4800
3214  Nissan Junior      Blue         1540  1375    105
1111  Nissan Junior     White         1540  1383    105
2525  Nissan Junior      Blue         1600  1375    130
2445  Nissan Junior       Red         1540  1389    145

In [28]:
df_test = cars_df.copy()

peykan_price = df_test.loc[df_test.model == 'Peykan', 'price']
df_test.loc[df_test.model == 'Peykan', 'percent'] = (peykan_price - peykan_price.min())/(peykan_price.max() - peykan_price.min())*100

df_test

              model     Color  Weight (KG)  year  price    percent
3523         Peykan       Red          990  1346     25    0.00000
2636         Peykan     White         1000  1357     30   21.73913
1031         Peykan     Olive          990  1388     48  100.00000
2159         BMW X6     Black         2320  1391   2200        NaN
2973         BMW X6  Ametrine         2320  1393   4800        NaN
1083         BMW X6      navy         2220  1393   4800        NaN
3214  Nissan Junior      Blue         1540  1375    105        NaN
1111  Nissan Junior     White         1540  1383    105        NaN
2525  Nissan Junior      Blue         1600  1375    130        NaN
2445  Nissan Junior       Red         1540  1389    145        NaN

In [29]:

BMW_price = df_test.loc[df_test.model == 'BMW X6', 'price']
df_test.loc[df_test.model == 'BMW X6', 'percent'] = (BMW_price - BMW_price.min())/(BMW_price.max() - BMW_price.min())*100

Nissan_price = df_test.loc[df_test.model == 'Nissan Junior', 'price']
df_test.loc[df_test.model == 'Nissan Junior', 'percent'] = (Nissan_price - Nissan_price.min())/(Nissan_price.max() - Nissan_price.min())*100

df_test

              model     Color  Weight (KG)  year  price    percent
3523         Peykan       Red          990  1346     25    0.00000
2636         Peykan     White         1000  1357     30   21.73913
1031         Peykan     Olive          990  1388     48  100.00000
2159         BMW X6     Black         2320  1391   2200    0.00000
2973         BMW X6  Ametrine         2320  1393   4800  100.00000
1083         BMW X6      navy         2220  1393   4800  100.00000
3214  Nissan Junior      Blue         1540  1375    105    0.00000
1111  Nissan Junior     White         1540  1383    105    0.00000
2525  Nissan Junior      Blue         1600  1375    130   62.50000
2445  Nissan Junior       Red         1540  1389    145  100.00000

In [30]:
df_copy = cars_df.copy()
df_copy['percent'] = df_copy.groupby('model')['price'].transform(lambda x: ((x-x.min())/(x.max()-x.min()))*100)
df_copy

              model     Color  Weight (KG)  year  price    percent
3523         Peykan       Red          990  1346     25    0.00000
2636         Peykan     White         1000  1357     30   21.73913
1031         Peykan     Olive          990  1388     48  100.00000
2159         BMW X6     Black         2320  1391   2200    0.00000
2973         BMW X6  Ametrine         2320  1393   4800  100.00000
1083         BMW X6      navy         2220  1393   4800  100.00000
3214  Nissan Junior      Blue         1540  1375    105    0.00000
1111  Nissan Junior     White         1540  1383    105    0.00000
2525  Nissan Junior      Blue         1600  1375    130   62.50000
2445  Nissan Junior       Red         1540  1389    145  100.00000

In [31]:
models = cars_df['model'].value_counts() >= 4
models

model
Nissan Junior     True
Peykan           False
BMW X6           False
Name: count, dtype: bool

In [32]:
cars_df.apply(lambda x : models[x.model] , axis = 1)

3523    False
2636    False
1031    False
2159    False
2973    False
1083    False
3214     True
1111     True
2525     True
2445     True
dtype: bool

In [33]:
cars_df [ cars_df.apply(lambda x : models[x.model] , axis = 1) ]

              model  Color  Weight (KG)  year  price
3214  Nissan Junior   Blue         1540  1375    105
1111  Nissan Junior  White         1540  1383    105
2525  Nissan Junior   Blue         1600  1375    130
2445  Nissan Junior    Red         1540  1389    145

In [34]:
cars_df.groupby('model').filter(lambda x : len(x) >= 4)

              model  Color  Weight (KG)  year  price
3214  Nissan Junior   Blue         1540  1375    105
1111  Nissan Junior  White         1540  1383    105
2525  Nissan Junior   Blue         1600  1375    130
2445  Nissan Junior    Red         1540  1389    145